In [1]:
import pandas as pd
import numpy as np

In [3]:
df_s = pd.DataFrame(dict(v1 = [100, 200, 300],
                         v2 = [400, 500, 600],
                         shape = ["A", "B", "C"]))
df_s

    v1   v2 shape
0  100  400     A
1  200  500     B
2  300  600     C

In [4]:
df_s.iloc[:2, ]

    v1   v2 shape
0  100  400     A
1  200  500     B

In [5]:
df_s.loc[:2, ]

    v1   v2 shape
0  100  400     A
1  200  500     B
2  300  600     C

In [9]:
df_s.v1

0    100
1    200
2    300
Name: v1, dtype: int64

In [10]:
df_s.shape

(3, 3)

In [8]:
df_s["shape"]

0    A
1    B
2    C
Name: shape, dtype: object

In [11]:
df_s.iloc[:, :-1]

    v1   v2
0  100  400
1  200  500
2  300  600

In [13]:
df_s.drop(columns = "shape")

    v1   v2
0  100  400
1  200  500
2  300  600

In [ ]:
df_s.loc[:, "v2":]

In [15]:
df_s.loc[df_s["v1"] == 200, ]

    v1   v2 shape
1  200  500     B

In [16]:
df_s.loc[df_s["v1"] != 200, ]

    v1   v2 shape
0  100  400     A
2  300  600     C

In [17]:
df_s["v1"] == 200

0    False
1     True
2    False
Name: v1, dtype: bool

In [18]:
~(df_s["v1"] == 200)

0     True
1    False
2     True
Name: v1, dtype: bool

In [19]:
df_s.loc[~(df_s["v1"] == 200), ]

    v1   v2 shape
0  100  400     A
2  300  600     C

In [20]:
df_s.loc[(df_s["v1"] == 200) & (df_s["v2"] == 600), ]

Empty DataFrame
Columns: [v1, v2, shape]
Index: []

In [21]:
df_s.loc[(df_s["v1"] == 200) | (df_s["v2"] == 600), ]

    v1   v2 shape
1  200  500     B
2  300  600     C

In [25]:
condi_1 = df_s["v1"] == 200
condi_2 = df_s["v2"] == 500
df_s.loc[condi_1 & condi_2, ]

    v1   v2 shape
1  200  500     B

In [29]:
df_s.loc[(df_s["shape"] == "A") | (df_s["shape"] == "C"), ]

    v1   v2 shape
0  100  400     A
2  300  600     C

In [30]:
df_s.loc[df_s["shape"].isin(["A", "C"]), ]

    v1   v2 shape
0  100  400     A
2  300  600     C

In [ ]:
df_s.loc[~df_s["shape"].isin(["A", "C"]), ]

In [33]:
df_s2 = df_s.add_suffix("_nor")
df_s2

   v1_nor  v2_nor shape_nor
0     100     400         A
1     200     500         B
2     300     600         C

In [ ]:
df = pd.read_csv("krx_202105_utf8.csv")
df.head(2)

In [ ]:
df_sub = df.loc[df["지수명"] == "KRX 300", ]
df_sub

In [45]:
df.loc[df["종가"] == df["종가"].max(), ["지수명", "종가", "날짜"]]

         지수명        종가        날짜
117  KTOP 30  11869.29  20210510

In [46]:
df["종가"].idxmax()

117

In [47]:
df.loc[df["종가"].idxmax(), ["지수명", "종가", "날짜"]]

지수명     KTOP 30
종가     11869.29
날짜     20210510
Name: 117, dtype: object

In [48]:
df.loc[[df["종가"].idxmax()], ["지수명", "종가", "날짜"]]

         지수명        종가        날짜
117  KTOP 30  11869.29  20210510

In [54]:
df = pd.read_csv("iris_missing.csv")
df_sub = df.head()
df_sub

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
df_sub.info()

In [ ]:
df_sub.count()

In [58]:
df_sub.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [57]:
df_sub.isna().sum()

Sepal.Length    0
Sepal.Width     1
Petal.Length    1
Petal.Width     0
Species         0
dtype: int64

In [ ]:
df_sub.isna()

In [ ]:
df_sub.isna().sum(axis = 1)

In [60]:
df_sub1 = df_sub.loc[df_sub["Sepal.Width"].isna(), ]
df_sub1

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa

In [61]:
df_sub2 = df_sub.loc[df_sub["Sepal.Width"].notna(), ]
df_sub2

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [62]:
df_sub3 = df_sub.dropna()
df_sub3

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
df.head()

In [71]:
df_sub.loc[:, "Sepal.Width"] = df_sub["Sepal.Width"].fillna(-999)
df_sub["Petal.Length"] = df_sub["Petal.Length"].fillna(df_sub["Petal.Length"].mean())
df_sub

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1       -999.0           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

시험버전은 객체가 얕은 복사가 되는 경우가 많아서  
필터링 등 특정 작업 이후 .copy() 또는 .reset_index() 적극 활용 권장.

In [ ]:
# df_sub2 = df_sub.head().copy()
df_sub2 = df_sub.head().reset_index(drop = True)
df_sub2.loc[:, "Sepal.Width"] = df_sub2["Sepal.Width"].fillna(-999)
df_sub2["Petal.Length"] = df_sub2["Petal.Length"].fillna(df_sub2["Petal.Length"].mean())
df_sub2

In [73]:
df_sub3 = df_sub.set_index("Species").reset_index()
df_sub3

  Species  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0  setosa           5.1       -999.0           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2
3  setosa           4.6          3.1           1.5          0.2
4  setosa           5.0          3.6           1.4          0.2

In [76]:
# df_sub.sort_values("Sepal.Length")
df_sub4 = df_sub.sort_values("Sepal.Length") # 지시사항 없는 자의에 의한 정렬은 재시험의 지름길.

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
3           4.6          3.1           1.5          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
0           5.1       -999.0           1.4          0.2  setosa

* 원소/조합 세기: https://datadoctorblog.com/2023/04/04/Py-Basic-Pandas-Counting/
* crosstab(): https://datadoctorblog.com/2023/05/06/Py-Basic-Pandas-Crosstab/

In [ ]:
df = pd.read_csv("bike.csv")
df.head(1)

In [81]:
df["season"].unique()

array([1, 2, 3, 4])

In [82]:
df["season"].nunique()

4

In [83]:
df["season"].drop_duplicates()

0       1
1323    2
2690    3
4055    4
Name: season, dtype: int64

In [ ]:
df.iloc[1322:1325, ]

In [ ]:
df["season"].value_counts()

In [88]:
df["season"].value_counts().sort_index()

season
1    2686
2    2733
3    2733
4    2734
Name: count, dtype: int64

In [89]:
df["season"].value_counts(normalize = True)

season
4    0.251148
2    0.251056
3    0.251056
1    0.246739
Name: proportion, dtype: float64

In [ ]:
df[["season", "holiday"]].drop_duplicates()

In [91]:
pd.crosstab(df["season"], df["holiday"])

holiday     0   1
season
1        2615  71
2        2685  48
3        2637  96
4        2638  96

* .groupby(): https://datadoctorblog.com/2023/04/28/Py-Basic-Pandas-Groupby/

In [ ]:
df = pd.read_csv("diamonds.csv")
df.head(2)

In [ ]:
df.groupby("color")["price"].max()

In [ ]:
df_g = df.groupby("color")["price"].max().reset_index()
df_g

In [ ]:
df.groupby("color")[["price", "carat"]].max()

In [ ]:
df.groupby(["color", "cut"])["price"].mean()

In [99]:
df_g2 = df.groupby(["color", "cut"])["price"].mean().reset_index()
df_g2.head()

  color        cut        price
0     D       Fair  4291.061350
1     D       Good  3405.382175
2     D      Ideal  2629.094566
3     D    Premium  3631.292576
4     D  Very Good  3470.467284

In [103]:
# 시험 기출 전처리 유형🎯🎯🎯
df_g3 = df.groupby("color")[["price", "carat"]].agg({"price": "max", "carat": "min"}).reset_index()
df_g3.head()

  color  price  carat
0     D  18693   0.20
1     E  18731   0.20
2     F  18791   0.20
3     G  18818   0.23
4     H  18803   0.23

In [ ]:
df_tx = pd.DataFrame(dict(v1 = [100, 200, 300],
                          v2 = ["abc", "aaa", "ccc"],
                          v3 = [123, "1234-5678", "010-1234-5678"]))
df_tx

In [ ]:
df_tx["v2"].replace("a", "🔥")

In [108]:
df_tx["v2"].replace("aaa", "🔥")

0    abc
1      🔥
2    ccc
Name: v2, dtype: object

In [ ]:
df_tx["v2"].replace({"aaa": "🔥", "ccc": "🩵"})

In [ ]:
df_tx["v2"].str.replace("a", "🔥")

In [ ]:
df_tx["v2"].str.replace("aaa", "🔥")

In [112]:
df_tx["v2"].str.contains("a")

0     True
1     True
2    False
Name: v2, dtype: bool

In [113]:
~df_tx["v2"].str.contains("a")

0    False
1    False
2     True
Name: v2, dtype: bool

In [ ]:
df_tx.loc[df_tx["v2"].str.contains("a"), ]

In [115]:
df_tx.loc[~df_tx["v2"].str.contains("a"), ]

    v1   v2             v3
2  300  ccc  010-1234-5678

In [119]:
df_tx["v3"].values

array([123, '1234-5678', '010-1234-5678'], dtype=object)

In [ ]:
df_tx["v4"] = df_tx["v3"].astype("str")
df_tx["v4"].str.split("-")

In [ ]:
df_tx["v4"].str.split("-").explode()

In [122]:
df_tx["v4"].str.split("-").explode().unique()

array(['123', '1234', '5678', '010'], dtype=object)

In [126]:
df_tx_v4 = df_tx["v4"].str.split("-", expand = True)
df_tx_v4

      0     1     2
0   123  None  None
1  1234  5678  None
2   010  1234  5678

In [125]:
df_tx_v4_2 = df_tx_v4.add_prefix("v4_")
df_tx_v4_3 = df_tx_v4_2.fillna("🥗")
df_tx_v4_3

   v4_0  v4_1  v4_2
0   123     🥗     🥗
1  1234  5678     🥗
2   010  1234  5678

* 시간데이터: https://datadoctorblog.com/2023/04/14/Py-Basic-Pandas-Time-Data/

In [130]:
ser_t1 = pd.Series(["2077-12-18", "2077-12-19", "2077-12-20"])
ser_t2 = pd.Series(["2077년 12월 18일", "2077년 12월 19일", "2077년 12월 20일"])
ser_t3 = pd.Series([20241218, 20241219, 20241220])
ser_t4 = pd.Series([1234, 2345, 3456])

In [ ]:
pd.to_datetime(ser_t1)

In [ ]:
# pd.to_datetime(ser_t2) # 에러!!

In [ ]:
# https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior

In [133]:
pd.to_datetime(ser_t2, format = "%Y년 %m월 %d일")

0   2077-12-18
1   2077-12-19
2   2077-12-20
dtype: datetime64[ns]

In [ ]:
pd.to_datetime(ser_t3)

In [ ]:
pd.to_datetime(ser_t3.astype("str"))

In [136]:
pd.to_datetime(ser_t4)

0   1970-01-01 00:00:00.000001234
1   1970-01-01 00:00:00.000002345
2   1970-01-01 00:00:00.000003456
dtype: datetime64[ns]

In [139]:
pd.to_datetime(ser_t4, origin = "2070-01-01", unit = "D")

0   2073-05-19
1   2076-06-03
2   2079-06-19
dtype: datetime64[ns]

In [ ]:
df = pd.read_csv("bike.csv")
df.head(1)

In [ ]:
df_dt2 = df[["datetime"]].copy()
df_dt2.head(2)

In [145]:
df_dt2["datetime"] = pd.to_datetime(df_dt2["datetime"])

In [147]:
df_dt2["date"  ] = df_dt2["datetime"].dt.date
df_dt2["yyyymm"] = df_dt2["datetime"].dt.strftime("%Y-%m")
df_dt2["year"  ] = df_dt2["datetime"].dt.year
df_dt2["month" ] = df_dt2["datetime"].dt.month
df_dt2["wday"  ] = df_dt2["datetime"].dt.weekday
df_dt2["wend"  ] = np.where(df_dt2["wday"] >= 5, 1, 0)
df_dt2["hour"  ] = df_dt2["datetime"].dt.hour
df_dt2["dt_s9h"] = df_dt2["datetime"] + pd.to_timedelta(9, unit = "h")

In [148]:
df_dt2.head()

,datetime,date,yyyymm,year,month,wday,wend,hour,dt_s9h
0,2011-01-01 00:00:00,2011-01-01,2011-01,2011,1,5,1,0,2011-01-01 09:00:00
1,2011-01-01 01:00:00,2011-01-01,2011-01,2011,1,5,1,1,2011-01-01 10:00:00
2,2011-01-01 02:00:00,2011-01-01,2011-01,2011,1,5,1,2,2011-01-01 11:00:00
3,2011-01-01 03:00:00,2011-01-01,2011-01,2011,1,5,1,3,2011-01-01 12:00:00
4,2011-01-01 04:00:00,2011-01-01,2011-01,2011,1,5,1,4,2011-01-01 13:00:00

In [149]:
df_dt2.dtypes

datetime    datetime64[ns]
date                object
yyyymm              object
year                 int32
month                int32
wday                 int32
wend                 int64
hour                 int32
dt_s9h      datetime64[ns]
dtype: object

In [ ]:
df_dt = pd.DataFrame(dict(date = ["2077-08-01", "2077-08-02", "2077-08-03"]))
df_dt["origin"] = "2077-01-01"
df_dt["date"  ] = pd.to_datetime(df_dt["date"])
df_dt["origin"] = pd.to_datetime(df_dt["origin"])
df_dt["diff"  ] = df_dt["date"] - df_dt["origin"]
df_dt["diff_d"] = df_dt["diff"].dt.days # <-- 
df_dt

In [168]:
df_dt["diff"  ]

0   212 days
1   213 days
2   214 days
Name: diff, dtype: timedelta64[ns]

In [167]:
df_dt["diff"  ].dt.total_seconds() / (3600 * 24)

0    212.0
1    213.0
2    214.0
Name: diff, dtype: float64

In [169]:
df_t = pd.DataFrame(dict(date = pd.date_range("2024-01-01", "2024-01-07"),
                         v = [100, 200, 300, np.nan, 500, 600, 700]))
df_t["v_s1"] = df_t["v"].shift(1)
df_t["v_s2"] = df_t["v"].shift(2) # 굳이 필요 없음.
df_t["v_sn1"] = df_t["v"].shift(-1)
df_t["v_fill_1"] = np.where(df_t["v"].isna(), (df_t["v_s1"] + df_t["v_sn1"]) / 2, df_t["v"])
df_t["v_fill_2"] = df_t["v"].interpolate()

In [170]:
df_t

        date      v   v_s1   v_s2  v_sn1  v_fill_1  v_fill_2
0 2024-01-01  100.0    NaN    NaN  200.0     100.0     100.0
1 2024-01-02  200.0  100.0    NaN  300.0     200.0     200.0
2 2024-01-03  300.0  200.0  100.0    NaN     300.0     300.0
3 2024-01-04    NaN  300.0  200.0  500.0     400.0     400.0
4 2024-01-05  500.0    NaN  300.0  600.0     500.0     500.0
5 2024-01-06  600.0  500.0    NaN  700.0     600.0     600.0
6 2024-01-07  700.0  600.0  500.0    NaN     700.0     700.0

In [ ]:
df_e = pd.read_csv("elec_load_2017_7d.csv")
df_e.head(1)

In [ ]:
df_e_m = df_e.melt(id_vars = ["YEAR", "MONTH", "DAY"])
df_e_m.head(2)

In [175]:
df_e_m = df_e.melt(id_vars = ["YEAR", "MONTH", "DAY"], var_name = "HOUR", value_name = "LOAD")
df_e_m.head(2)

   YEAR  MONTH  DAY  HOUR   LOAD
0  2017      1    1  X1HR  60178
1  2017      1    2  X1HR  57067

In [176]:
df_e_m["h1"] = df_e_m["HOUR"].str.replace("X", "").str.replace("HR", "")
# regex: regular expression 정규표현식
df_e_m["h2"] = df_e_m["HOUR"].str.replace("X|HR", "", regex = True) # X 또는 HR 을 제거
df_e_m["h3"] = df_e_m["HOUR"].str.replace("[A-Z]", "", regex = True)
df_e_m["h4"] = df_e_m["HOUR"].str.replace("[^0-9]", "", regex = True)
df_e_m["h5"] = df_e_m["h1"].astype("int")

In [181]:
df_e_m.tail(2)

     YEAR  MONTH  DAY   HOUR   LOAD  h1  h2  h3  h4  h5
166  2017      1    6  X24HR  63214  24  24  24  24  24
167  2017      1    7  X24HR  69219  24  24  24  24  24

In [ ]:
df_e_m.dtypes

In [ ]:
df = pd.read_csv("diamonds.csv")
df.head(1)

In [194]:
df_g1 = df.groupby(["clarity", "cut"])["price"].mean().reset_index()
df_g1.head(2)

  clarity   cut        price
0      I1  Fair  3703.533333
1      I1  Good  3596.635417

In [195]:
df_g2 = pd.crosstab(index = df["clarity"], columns = df["cut"], values = df["price"], aggfunc = "mean")
df_g2 = df_g2.round(1).reset_index()
df_g2

cut clarity    Fair    Good   Ideal  Premium  Very Good
0        I1  3703.5  3596.6  4335.7   3947.3     4078.2
1        IF  1912.3  4098.3  2272.9   3856.1     4396.2
2       SI1  4208.3  3689.5  3752.1   4455.3     3932.4
3       SI2  5173.9  4580.3  4756.0   5545.9     4988.7
4       VS1  4165.1  3801.4  3489.7   4485.5     3805.4
5       VS2  4174.7  4262.2  3284.6   4550.3     4215.8
6      VVS1  3871.4  2254.8  2468.1   2831.2     2459.4
7      VVS2  3349.8  3079.1  3250.3   3795.1     3037.8

In [196]:
df_g3 = df.pivot_table(index = "clarity", columns = "cut", values = "price", aggfunc = "mean")
df_g3 = df_g3.round(1).reset_index()
df_g3

cut clarity    Fair    Good   Ideal  Premium  Very Good
0        I1  3703.5  3596.6  4335.7   3947.3     4078.2
1        IF  1912.3  4098.3  2272.9   3856.1     4396.2
2       SI1  4208.3  3689.5  3752.1   4455.3     3932.4
3       SI2  5173.9  4580.3  4756.0   5545.9     4988.7
4       VS1  4165.1  3801.4  3489.7   4485.5     3805.4
5       VS2  4174.7  4262.2  3284.6   4550.3     4215.8
6      VVS1  3871.4  2254.8  2468.1   2831.2     2459.4
7      VVS2  3349.8  3079.1  3250.3   3795.1     3037.8

In [198]:
df_bike = pd.read_csv("bike.csv")
df_b1 = df_bike.iloc[:4, 4:7]
df_b2 = df_bike.iloc[1:5, 5:8]

In [ ]:
pd.concat([df_b1, df_b2])

In [ ]:
pd.concat([df_b1, df_b2], axis = 1)

In [ ]:
pd.concat([df_b1, df_b2.reset_index(drop = True).add_suffix("_y")], axis = 1)

In [ ]:
df.head(20)

In [216]:
df_g1 = df.head(10).groupby("color")["price"].mean().reset_index()
df_g1

  color  price
0     E  329.0
1     H  337.5
2     I  335.0
3     J  335.5

In [ ]:
df_g2 = df.groupby("color")["carat"].max().reset_index()
df_g2

In [ ]:
df_join1 = pd.merge(df_g1,             df_g2, 
                    left_on = "color", right_on = "color", how = "inner")
df_join1

In [219]:
df_join2 = pd.merge(df_g2, df_g1, on = "color", how = "left")
df_join2

  color  carat  price
0     D   3.40    NaN
1     E   3.05  329.0
2     F   3.01    NaN
3     G   3.01    NaN
4     H   4.13  337.5
5     I   4.01  335.0
6     J   5.01  335.5

In [225]:
def udf_1(x):
    return x.sum() + 10000

In [ ]:
df.groupby("cut")["carat"].agg(udf_1)

In [227]:
df.groupby("cut")["carat"].agg(lambda x: x.sum() + 10000)

cut
Fair         11684.28
Good         14166.10
Ideal        25146.84
Premium      22300.95
Very Good    19742.70
Name: carat, dtype: float64